04_CFD/pipeline/test_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    back
    {
        type            empty;
        physicalType    patch;
        nFaces          39104;
        startFace       61171;
    }
    front
    {
        type            empty;
        physicalType    patch;
        nFaces          39104;
        startFace       100275;
    }
    farfield
    {
        type            patch;
        physicalType    patch;
        nFaces          60;
        startFace       139379;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       139439;
    }
    airfoil
    {
        type            wall;
        physicalType    patch;
        nFaces          511;
        startFace       139459;
    }
)

// ************************************************************************* //
