04_CFD/pipeline/test_case/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (50.765370 5.335655 0);

boundaryField
{
    front
{
    type            empty;
}
back
{
    type            empty;
}
    airfoil
    {
        type            noSlip;
    }

    farfield
    {
        // freestream maneja entrada Y salida en la misma cara según el
        // signo local del flujo -- ideal para el borde curvo del dominio C
        type            freestreamVelocity;
        freestreamValue uniform (50.765370 5.335655 0);
    }

    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (50.765370 5.335655 0);
    }

    

    
}

// ************************************************************************* //
