04_CFD/pipeline/test_case/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
{
    type            empty;
}
back
{
    type            empty;
}
    airfoil
    {
        type            zeroGradient;
    }

    farfield
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }

    outlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }

    

    
}

// ************************************************************************* //
