04_CFD/pipeline/test_case/0/nuTilda
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4.500000e-05;

boundaryField
{
    front
{
    type            empty;
}
back
{
    type            empty;
}
    airfoil
    {
        type            fixedValue;
        value           uniform 0;
    }

    farfield
    {
        type            freestream;
        freestreamValue uniform 4.500000e-05;
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform 4.500000e-05;
    }

    

    
}

// ************************************************************************* //
